# 7. Создать (не программно) текстовый файл, в котором каждая строка должна содержать данные о фирме: название,
# форма собственности, выручка, издержки.
# Пример строки файла: firm_1 ООО 10000 5000.
# Необходимо построчно прочитать файл, вычислить прибыль каждой компании, а также среднюю прибыль.
# Если фирма получила убытки, в расчет средней прибыли ее не включать.
# Далее реализовать список. Он должен содержать словарь с фирмами и их прибылями, а также словарь со средней прибылью.
# Если фирма получила убытки, также добавить ее в словарь (со значением убытков).
# Пример списка: [{“firm_1”: 5000, “firm_2”: 3000, “firm_3”: 1000}, {“average_profit”: 2000}].
# Итоговый список сохранить в виде json-объекта в соответствующий файл.
# Пример json-объекта:
# [{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit": 2000}]
#
# Подсказка: использовать менеджеры контекста.

import json

firm_dict = {}
general_profit = 0
firms = 0

with open('my_file.txt', 'r') as f:
    for line in f:
        firm_profit = int(line.split()[2]) - int(line.split()[3])
        firm_dict[line.split()[0]] = firm_profit
        if firm_profit > 0:
            general_profit += firm_profit
            firms += 1

    firm_list = [firm_dict, {"average_profit": general_profit / firms}]

with open('firms_profit.json', 'w') as f:
    json.dump(firm_list, f)
